# 时间粒度
dateType <- list(
  '日' = 'day',
  '月' = 'month'
)

# 国家列表中->英映射
country_list <- list(
  '日本' = 'JP',
  '韩国' = 'KR',
  '美国' = 'US',
  '意大利' = 'IT',
  '泰国' = 'TH'
)
# 年度列表
year_list <- list(
  '2017' = '2017',
  '2018' = '2018',
  '2019' = '2019'
)

# 统计量列表
stat_list <- list(
  '求和' = 'sum',
  '均值' = 'mean',
  '中位数' = 'median'
)

# 月份名称中->数映射
month_list <- list(
  '一月' = '01',
  '二月' = '02',
  '三月' = '03',
  '四月' = '04',
  '五月' = '05',
  '六月' = '06',
  '七月' = '07',
  '八月' = '08',
  '九月' = '09',
  '十月' = '10',
  '十一月' = '11',
  '十二月' = '12'
)
# 国家映射
countrymap <- data.frame(ename = c('JP', 'KR','US','IT','TH'),
                         cname = c('日本', '韩国', '美国', '意大利', '泰国'))


# 模型列表
model_list <- list(
  'STL' = 0, 
  'ARIMA' = 1
)